import voodooDoll from '../../images/haunted-mirror.jpg';
import hauntedMirror from '../../images/haunted-mirror.jpg';
import ouijaBoard from '../../images/haunted-mirror.jpg';
import tarotCards from '../../images/haunted-mirror.jpg';
import musicBox from '../../images/haunted-mirror.jpg';
import monkeyPaw from '../../images/haunted-mirror.jpg';
import magicCircle from '../../images/haunted-mirror.jpg';

export const ghosts = [
    { name: 'Дух', evidences: ['ЭМП (ур. 5)', 'Радиоприёмник', 'Записи в блокноте'] },
    { name: 'Мираж', evidences: ['ЭМП (ур. 5)', 'Радиоприёмник', 'Лазерный проектор'] },
    { name: 'Фантом', evidences: ['Радиоприёмник', 'Ультрафиолет', 'Лазерный проектор'] },
    { name: 'Полтергейст', evidences: ['Радиоприёмник', 'Ультрафиолет', 'Записи в блокноте'] },
    { name: 'Банши', evidences: ['Ультрафиолет', 'Призрачный огонёк', 'Лазерный проектор'] },
    { name: 'Джинн', evidences: ['ЭМП (ур. 5)', 'Ультрафиолет', 'Минусовая температура'] },
    { name: 'Мара', evidences: ['Радиоприёмник', 'Призрачный огонёк', 'Записи в блокноте'] },
    { name: 'Ревенант', evidences: ['Призрачный огонёк', 'Записи в блокноте', 'Минусовая температура '] },
    { name: 'Тень', evidences: ['ЭМП (ур. 5)', 'Записи в блокноте', 'Минусовая температура'] },
    { name: 'Демон', evidences: ['Ультрафиолет', 'Записи в блокноте', 'Минусовая температура'] },
    { name: 'Юрэй', evidences: ['Призрачный огонёк', 'Минусовая температура', 'Лазерный проектор'] },
    { name: 'Они', evidences: ['ЭМП (ур. 5)', 'Минусовая температура', 'Лазерный проектор'] },
    { name: 'Ёкай', evidences: ['Радиоприёмник', 'Призрачный огонёк', 'Лазерный проектор'] },
    { name: 'Ханту', evidences: ['Ультрафиолет', 'Призрачный огонёк', 'Минусовая температура'] },
    { name: 'Горё', evidences: ['ЭМП (ур. 5)', 'Ультрафиолет', 'Лазерный проектор'] },
    { name: 'Мюлинг', evidences: ['ЭМП (ур. 5)', 'Ультрафиолет', 'Записи в блокноте'] },
    { name: 'Онрё', evidences: ['Радиоприёмник', 'Призрачный огонёк', 'Минусовая температура'] },
    { name: 'Близнецы', evidences: ['ЭМП (ур. 5)', 'Радиоприёмник', 'Минусовая температура'] },
    { name: 'Райдзю', evidences: ['ЭМП (ур. 5)', 'Призрачный огонёк', 'Лазерный проектор'] },
    { name: 'Обакэ', evidences: ['ЭМП (ур. 5)', 'Ультрафиолет', 'Призрачный огонёк'] },
    { name: 'Мимик', evidences: ['Радиоприёмник', 'Ультрафиолет', 'Минусовая температура'] },
    { name: 'Морой', evidences: ['Радиоприёмник', 'Записи в блокноте', 'Минусовая температура'] },
    { name: 'Деоген', evidences: ['Радиоприёмник', 'Записи в блокноте', 'Лазерный проектор'] },
    { name: 'Тайэ', evidences: ['Призрачный огонёк', 'Записи в блокноте', 'Лазерный проектор'] },
  ];

  export const evidences = [
    'ЭМП (ур. 5)', 'Ультрафиолет', 'Записи в блокноте', 'Минусовая температура', 
    'Лазерный проектор', 'Призрачный огонёк', 'Радиоприёмник'
  ];
  
  export const ghostDetails = {
    'Дух': {
      description: 'Описание Духа...',
      behavior: 'Поведение Духа...',
      strategy: 'Стратегия против Духа...'
    },
    'Мираж': {
      description: 'Описание Миража...',
      behavior: 'Поведение Миража...',
      strategy: 'Стратегия против Миража...'
    },
    'Фантом': {
      description: 'Описание Фантом...',
      behavior: 'Поведение Фантом...',
      strategy: 'Стратегия против Фантом...'
    },
    'Полтергейст': {
      description: 'Описание Полтергейст...',
      behavior: 'Поведение Полтергейст...',
      strategy: 'Стратегия против Полтергейст...'
    },
    'Банши': {
      description: 'Описание Банши...',
      behavior: 'Поведение Банши...',
      strategy: 'Стратегия против Банши...'
    },
    'Джинн': {
      description: 'Описание Джинн...',
      behavior: 'Поведение Джинн...',
      strategy: 'Стратегия против Джинн...'
    },
    'Мара': {
      description: 'Описание Мара...',
      behavior: 'Поведение Мара...',
      strategy: 'Стратегия против Мара...'
    },
    'Ревенант': {
      description: 'Описание Ревенант...',
      behavior: 'Поведение Ревенант...',
      strategy: 'Стратегия против Ревенант...'
    },
    'Тень': {
      description: 'Описание Тень...',
      behavior: 'Поведение Тень...',
      strategy: 'Стратегия против Тень...'
    },
    'Демон': {
      description: 'Описание Демон...',
      behavior: 'Поведение Демон...',
      strategy: 'Стратегия против Демон...'
    },
    'Юрэй': {
      description: 'Описание Юрэй...',
      behavior: 'Поведение Юрэй...',
      strategy: 'Стратегия против Юрэй...'
    },
    'Они': {
      description: 'Описание Они...',
      behavior: 'Поведение Они...',
      strategy: 'Стратегия против Они...'
    },
    'Ёкай': {
      description: 'Описание Ёкай...',
      behavior: 'Поведение Ёкай...',
      strategy: 'Стратегия против Ёкай...'
    },
    'Ханту': {
      description: 'Описание Ханту...',
      behavior: 'Поведение Ханту...',
      strategy: 'Стратегия против Ханту...'
    },
    'Горё': {
      description: 'Описание Горё...',
      behavior: 'Поведение Горё...',
      strategy: 'Стратегия против Горё...'
    },
    'Мюлинг': {
      description: 'Описание Мюлинг...',
      behavior: 'Поведение Мюлинг...',
      strategy: 'Стратегия против Мюлинг...'
    },
    'Онрё': {
      description: 'Описание Онрё...',
      behavior: 'Поведение Онрё...',
      strategy: 'Стратегия против Онрё...'
    },
    'Близнецы': {
      description: 'Описание Близнецы...',
      behavior: 'Поведение Близнецы...',
      strategy: 'Стратегия против Близнецы...'
    },
    'Райдзю': {
      description: 'Описание Райдзю...',
      behavior: 'Поведение Райдзю...',
      strategy: 'Стратегия против Райдзю...'
    },
    'Обакэ': {
      description: 'Описание Обакэ...',
      behavior: 'Поведение Обакэ...',
      strategy: 'Стратегия против Обакэ...'
    },
    'Мимик': {
      description: 'Описание Мимик...',
      behavior: 'Поведение Мимик...',
      strategy: 'Стратегия против Мимик...'
    },
    'Морой': {
      description: 'Описание Морой...',
      behavior: 'Поведение Морой...',
      strategy: 'Стратегия против Морой...'
    },
    'Деоген': {
      description: 'Описание Деоген...',
      behavior: 'Поведение Деоген...',
      strategy: 'Стратегия против Деоген...'
    },
    'Тайэ': {
      description: 'Описание Тайэ...',
      behavior: 'Поведение Тайэ...',
      strategy: 'Стратегия против Тайэ...'
    },

  };
export const CursedItem = [
  { name: 'Кукла Вуду', image: voodooDoll, description: 'Описание куклы Вуду.' },
  { name: 'Зачарованное зеркало', image: hauntedMirror, description: 'Описание зачарованного зеркала.' },
  { name: 'Доска Уиджи', image: ouijaBoard, description: 'Описание доски Уиджи.' },
  { name: 'Карты Таро', image: tarotCards, description: 'Описание карт Таро.' },
  { name: 'Музыкальная шкатулка', image: musicBox, description: 'Описание музыкальной шкатулки.' },
  { name: 'Обезьянья лапа', image: monkeyPaw, description: 'Описание обезьяньей лапы.' },
  { name: 'Магический круг', image: magicCircle, description: 'Описание магического круга.' },
];

export const equipmentData = [
  { name: 'Лазерный проектор', image: 'camera.jpg', description: 'Лазерный проектор — это стартовое снаряжение, доступное с начала игры, а также своего рода улика, которая используется для выявления движения призрака. \n Лазерный проектор можно разместить на стене или полу «F (по умолч.)». Он излучает матрицу ярко-зелёных лазерных точек на небольшой площади от проектора. \nПризраки с доказательством Лазерной проекции иногда переходят в «состояние проекции». При этом слабый силуэт призрака будет виден только тогда, когда он пройдёт через лазерную сетку. Призрак пойдёт к ближайшему игроку, если он есть в той же комнате, или к случайной точке маршрута, если поблизости нет игроков. Хотя эти силуэты видны невооруженным глазом (если призрак не Горё), видеокамера с ночным видением может обеспечить лучшую видимость. Это означает, что лазерную проекцию можно отслеживать одновременно с призрачным огоньком. \n Все установленные проекторы можно включать и выключать нажатием ЛКМ. \n Вращение лазерного проектора Т3 можно приостанавливать с помощью ЛКМ без прекращения работы. \n Силуэт призрака на лазерном проекторе можно сфотографировать и он будет подписан в журнале как Призрак. За это можно получить до 20$ и 20 XP, в зависимости от расстояния с которого была сделана фотография. Данная фотография засчитывается в задание «Сфотографировать призрака» без необходимости ждать паранормальное явление.' },
  { name: 'Детектор ЭМП', image: 'uv_light.jpg', description: 'Помогает находить отпечатки пальцев призрака.' },
  { name: 'Блокнот', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },
  { name: 'Радиоприёмник', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },
  { name: 'Термометр', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },
  { name: 'УФ-фонарик', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },
  { name: 'Видеокамера', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },
  { name: 'Распятие', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' }, 
  { name: 'Светильник', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' }, 
  { name: 'Фонарик', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' }, 
  { name: 'Крепление на голову', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' }, 
  { name: 'Зажигалка', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Благовоние', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Датчик движения', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Направленный микрофон', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Фотокамера', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Соль', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Успокоительное', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Датчик звука', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'Штатив', image: 'spirit_box.jpg', description: 'Используется для общения с призраком.' },   
  { name: 'СКОРО', image: 'spirit_box.jpg', description: 'СКОРО' },   
];

export const evidenceData = [
  {
    name: 'ЭМП (ур.5)',
    description: 'Подробности о первой улице.',
    image: 'evidence1.png',
  },
  {
    name: 'Лазерный проектор',
    description: 'Подробности о второй улице.',
    image: 'evidence2.png',
  },
  {
    name: 'Ультрафиолет',
    description: 'Подробности о второй улице.',
    image: 'evidence2.png',
  },
  {
    name: 'Призрачный огонёк',
    description: 'Подробности о второй улице.',
    image: 'evidence2.png',
  },
  {
    name: 'Записи в блокноте',
    description: 'Подробности о второй улице.',
    image: 'evidence2.png',
  },
  {
    name: 'Радиоприёмник',
    description: 'Подробности о второй улице.',
    image: 'evidence2.png',
  },
  {
    name: 'Минусовая температура',
    description: 'Подробности о второй улице.',
    image: 'evidence2.png',
  },
];